; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v8 ?v2)
             (pred_12 ?v7 ?v4)
             (pred_5 ?v8 ?v4)
             (pred_7 ?v13 ?v8 )
	     (pred_4 ?v8)
             (pred_1 ?v1)
             (pred_3 ?v7)
             (pred_9 ?v4)
             (pred_8 ?v8)
             (pred_2 ?v7)
             (pred_10 ?v8)
             (pred_6 ))



(:action op_3
:parameters (?v5 ?v11 ?v3 ?v6)
:precondition (and (pred_1 ?v5) (pred_1 ?v11) (pred_3 ?v3) (pred_9 ?v6)
          (pred_11 ?v5 ?v11) (pred_12 ?v3 ?v6)
                   (pred_5 ?v11 ?v6) (pred_4 ?v5) 
                   (pred_8 ?v11) (pred_2 ?v3))
:effect (and  (pred_10 ?v11) (not (pred_8 ?v11))))


(:action op_5
:parameters (?v5 ?v9)
:precondition (and (pred_1 ?v5) (pred_1 ?v9)
               (pred_4 ?v5) (pred_11 ?v5 ?v9) (pred_10 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v5))))

(:action op_1
:parameters (?v5 ?v3)
:precondition (and (pred_1 ?v5) (pred_3 ?v3) 
                  (pred_4 ?v5) (pred_7 ?v3 ?v5) (pred_6 ))
:effect (and (pred_2 ?v3)
   (not (pred_7 ?v3 ?v5)) (not (pred_6 ))))


(:action op_2
:parameters (?v5 ?v12 ?v10)
:precondition (and (pred_1 ?v5) (pred_3 ?v12) (pred_3 ?v10)
                  (pred_4 ?v5) (pred_2 ?v10) (pred_7 ?v12 ?v5))
:effect (and (pred_2 ?v12) (pred_7 ?v10 ?v5)
        (not (pred_2 ?v10)) (not (pred_7 ?v12 ?v5))))

(:action op_4
:parameters (?v5 ?v3)
:precondition (and (pred_1 ?v5) (pred_3 ?v3) 
                  (pred_4 ?v5) (pred_2 ?v3))
:effect (and (pred_6 ) (pred_7 ?v3 ?v5) (not (pred_2 ?v3)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_22 obj_06 obj_18 obj_13 obj_04 obj_20 obj_03 obj_16 obj_15 obj_08 obj_02 obj_25 obj_29 obj_19 obj_23 obj_12 obj_10 obj_27 obj_30 obj_21 obj_28 obj_14 obj_11 obj_24
    obj_26 obj_01
    obj_07 obj_17 obj_09
    )

    (:init
       (pred_6)

       (pred_1 obj_05)
       (pred_1 obj_22)
       (pred_1 obj_06)
       (pred_1 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_04)
       (pred_1 obj_20)
       (pred_1 obj_03)
       (pred_1 obj_16)
       (pred_1 obj_15)
       (pred_1 obj_08)
       (pred_1 obj_02)
       (pred_1 obj_25)
       (pred_1 obj_29)
       (pred_1 obj_19)
       (pred_1 obj_23)
       (pred_1 obj_12)
       (pred_1 obj_10)
       (pred_1 obj_27)
       (pred_1 obj_30)
       (pred_1 obj_21)
       (pred_1 obj_28)
       (pred_1 obj_14)
       (pred_1 obj_11)
       (pred_1 obj_24)
       (pred_9 obj_26)
       (pred_9 obj_01)
       (pred_3 obj_07)
       (pred_3 obj_17)
       (pred_3 obj_09)

       (pred_11 obj_05 obj_04)
       (pred_11 obj_05 obj_22)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_22 obj_06)
       (pred_11 obj_22 obj_05)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_06 obj_22)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_13 obj_15)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_04 obj_08)
       (pred_11 obj_04 obj_20)
       (pred_11 obj_04 obj_05)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_20 obj_04)
       (pred_11 obj_03 obj_25)
       (pred_11 obj_03 obj_16)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_16 obj_29)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_03)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_13)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_08 obj_23)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_08 obj_04)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_02 obj_25)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_02 obj_08)
       (pred_11 obj_25 obj_10)
       (pred_11 obj_25 obj_29)
       (pred_11 obj_25 obj_03)
       (pred_11 obj_25 obj_02)
       (pred_11 obj_29 obj_27)
       (pred_11 obj_29 obj_19)
       (pred_11 obj_29 obj_16)
       (pred_11 obj_29 obj_25)
       (pred_11 obj_19 obj_30)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_19 obj_29)
       (pred_11 obj_23 obj_21)
       (pred_11 obj_23 obj_12)
       (pred_11 obj_23 obj_08)
       (pred_11 obj_12 obj_28)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_12 obj_23)
       (pred_11 obj_10 obj_14)
       (pred_11 obj_10 obj_27)
       (pred_11 obj_10 obj_25)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_27 obj_11)
       (pred_11 obj_27 obj_30)
       (pred_11 obj_27 obj_29)
       (pred_11 obj_27 obj_10)
       (pred_11 obj_30 obj_24)
       (pred_11 obj_30 obj_19)
       (pred_11 obj_30 obj_27)
       (pred_11 obj_21 obj_28)
       (pred_11 obj_21 obj_23)
       (pred_11 obj_28 obj_14)
       (pred_11 obj_28 obj_12)
       (pred_11 obj_28 obj_21)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_14 obj_10)
       (pred_11 obj_14 obj_28)
       (pred_11 obj_11 obj_24)
       (pred_11 obj_11 obj_27)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_24 obj_30)
       (pred_11 obj_24 obj_11)
       (pred_8 obj_15)
       (pred_8 obj_29)
       (pred_8 obj_19)
       (pred_5  obj_15 obj_26)
       (pred_5  obj_29 obj_01)
       (pred_5  obj_19 obj_26)
       (pred_10 obj_05)
       (pred_10 obj_22)
       (pred_10 obj_06)
       (pred_10 obj_18)
       (pred_10 obj_13)
       (pred_10 obj_04)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_16)
       (pred_10 obj_08)
       (pred_10 obj_02)
       (pred_10 obj_25)
       (pred_10 obj_23)
       (pred_10 obj_12)
       (pred_10 obj_10)
       (pred_10 obj_27)
       (pred_10 obj_30)
       (pred_10 obj_21)
       (pred_10 obj_28)
       (pred_10 obj_14)
       (pred_10 obj_11)
       (pred_10 obj_24)

       (pred_12  obj_07 obj_26)
       (pred_12  obj_17 obj_01)
       (pred_12  obj_09 obj_26)
       (pred_7 obj_07 obj_18)
       (pred_7 obj_17 obj_11)
       (pred_7 obj_09 obj_05)
       (pred_4 obj_11)
    )

    (:goal (and
       (pred_7 obj_07 obj_02)
    ))
(:constraints
  (always (not (pred_4 obj_06)))
)
)

; plan
1. (op_5 obj_11 obj_27)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_27)
   goals met: 0 of 1
2. (op_5 obj_27 obj_10)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_10)
   goals met: 0 of 1
3. (op_5 obj_10 obj_25)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_25)
   goals met: 0 of 1
4. (op_5 obj_25 obj_03)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_03)
   goals met: 0 of 1
5. (op_5 obj_03 obj_16)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_16)
   goals met: 0 of 1
6. (op_5 obj_16 obj_18)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_18)
   goals met: 0 of 1
7. (op_1 obj_18 obj_07)
   deleted: (pred_7 obj_07 obj_18) (pred_6)
   added: (pred_2 obj_07)
   goals met: 0 of 1
8. (op_5 obj_18 obj_16)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_16)
   goals met: 0 of 1
9. (op_5 obj_16 obj_03)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_03)
   goals met: 0 of 1
10. (op_5 obj_03 obj_20)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_20)
   goals met: 0 of 1
11. (op_5 obj_20 obj_02)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_02)
   goals met: 0 of 1
12. (op_4 obj_02 obj_07)
   deleted: (pred_2 obj_07)
   added: (pred_6) (pred_7 obj_07 obj_02)
   goals met: 1 of 1
